espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Status register */
/** Type of etm_ch_ena_ad0 register
 *  Channel enable status register
 */
typedef union {
    struct {
        /** etm_ch_enabled0 : R/WTC/WTS; bitpos: [0]; default: 0;
         *  Represents ch0 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled0:1;
        /** etm_ch_enabled1 : R/WTC/WTS; bitpos: [1]; default: 0;
         *  Represents ch1 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled1:1;
        /** etm_ch_enabled2 : R/WTC/WTS; bitpos: [2]; default: 0;
         *  Represents ch2 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled2:1;
        /** etm_ch_enabled3 : R/WTC/WTS; bitpos: [3]; default: 0;
         *  Represents ch3 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled3:1;
        /** etm_ch_enabled4 : R/WTC/WTS; bitpos: [4]; default: 0;
         *  Represents ch4 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled4:1;
        /** etm_ch_enabled5 : R/WTC/WTS; bitpos: [5]; default: 0;
         *  Represents ch5 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled5:1;
        /** etm_ch_enabled6 : R/WTC/WTS; bitpos: [6]; default: 0;
         *  Represents ch6 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled6:1;
        /** etm_ch_enabled7 : R/WTC/WTS; bitpos: [7]; default: 0;
         *  Represents ch7 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled7:1;
        /** etm_ch_enabled8 : R/WTC/WTS; bitpos: [8]; default: 0;
         *  Represents ch8 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled8:1;
        /** etm_ch_enabled9 : R/WTC/WTS; bitpos: [9]; default: 0;
         *  Represents ch9 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled9:1;
        /** etm_ch_enabled10 : R/WTC/WTS; bitpos: [10]; default: 0;
         *  Represents ch10 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled10:1;
        /** etm_ch_enabled11 : R/WTC/WTS; bitpos: [11]; default: 0;
         *  Represents ch11 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled11:1;
        /** etm_ch_enabled12 : R/WTC/WTS; bitpos: [12]; default: 0;
         *  Represents ch12 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled12:1;
        /** etm_ch_enabled13 : R/WTC/WTS; bitpos: [13]; default: 0;
         *  Represents ch13 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled13:1;
        /** etm_ch_enabled14 : R/WTC/WTS; bitpos: [14]; default: 0;
         *  Represents ch14 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled14:1;
        /** etm_ch_enabled15 : R/WTC/WTS; bitpos: [15]; default: 0;
         *  Represents ch15 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled15:1;
        /** etm_ch_enabled16 : R/WTC/WTS; bitpos: [16]; default: 0;
         *  Represents ch16 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled16:1;
        /** etm_ch_enabled17 : R/WTC/WTS; bitpos: [17]; default: 0;
         *  Represents ch17 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled17:1;
        /** etm_ch_enabled18 : R/WTC/WTS; bitpos: [18]; default: 0;
         *  Represents ch18 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled18:1;
        /** etm_ch_enabled19 : R/WTC/WTS; bitpos: [19]; default: 0;
         *  Represents ch19 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled19:1;
        /** etm_ch_enabled20 : R/WTC/WTS; bitpos: [20]; default: 0;
         *  Represents ch20 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled20:1;
        /** etm_ch_enabled21 : R/WTC/WTS; bitpos: [21]; default: 0;
         *  Represents ch21 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled21:1;
        /** etm_ch_enabled22 : R/WTC/WTS; bitpos: [22]; default: 0;
         *  Represents ch22 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled22:1;
        /** etm_ch_enabled23 : R/WTC/WTS; bitpos: [23]; default: 0;
         *  Represents ch23 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled23:1;
        /** etm_ch_enabled24 : R/WTC/WTS; bitpos: [24]; default: 0;
         *  Represents ch24 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled24:1;
        /** etm_ch_enabled25 : R/WTC/WTS; bitpos: [25]; default: 0;
         *  Represents ch25 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled25:1;
        /** etm_ch_enabled26 : R/WTC/WTS; bitpos: [26]; default: 0;
         *  Represents ch26 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled26:1;
        /** etm_ch_enabled27 : R/WTC/WTS; bitpos: [27]; default: 0;
         *  Represents ch27 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled27:1;
        /** etm_ch_enabled28 : R/WTC/WTS; bitpos: [28]; default: 0;
         *  Represents ch28 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled28:1;
        /** etm_ch_enabled29 : R/WTC/WTS; bitpos: [29]; default: 0;
         *  Represents ch29 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled29:1;
        /** etm_ch_enabled30 : R/WTC/WTS; bitpos: [30]; default: 0;
         *  Represents ch30 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled30:1;
        /** etm_ch_enabled31 : R/WTC/WTS; bitpos: [31]; default: 0;
         *  Represents ch31 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_reg_t;

/** Type of etm_ch_ena_ad1 register
 *  Channel enable status register
 */
typedef union {
    struct {
        /** etm_ch_enabled32 : R/WTC/WTS; bitpos: [0]; default: 0;
         *  Represents ch32 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled32:1;
        /** etm_ch_enabled33 : R/WTC/WTS; bitpos: [1]; default: 0;
         *  Represents ch33 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled33:1;
        /** etm_ch_enabled34 : R/WTC/WTS; bitpos: [2]; default: 0;
         *  Represents ch34 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled34:1;
        /** etm_ch_enabled35 : R/WTC/WTS; bitpos: [3]; default: 0;
         *  Represents ch35 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled35:1;
        /** etm_ch_enabled36 : R/WTC/WTS; bitpos: [4]; default: 0;
         *  Represents ch36 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled36:1;
        /** etm_ch_enabled37 : R/WTC/WTS; bitpos: [5]; default: 0;
         *  Represents ch37 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled37:1;
        /** etm_ch_enabled38 : R/WTC/WTS; bitpos: [6]; default: 0;
         *  Represents ch38 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled38:1;
        /** etm_ch_enabled39 : R/WTC/WTS; bitpos: [7]; default: 0;
         *  Represents ch39 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled39:1;
        /** etm_ch_enabled40 : R/WTC/WTS; bitpos: [8]; default: 0;
         *  Represents ch40 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled40:1;
        /** etm_ch_enabled41 : R/WTC/WTS; bitpos: [9]; default: 0;
         *  Represents ch41 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled41:1;
        /** etm_ch_enabled42 : R/WTC/WTS; bitpos: [10]; default: 0;
         *  Represents ch42 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled42:1;
        /** etm_ch_enabled43 : R/WTC/WTS; bitpos: [11]; default: 0;
         *  Represents ch43 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled43:1;
        /** etm_ch_enabled44 : R/WTC/WTS; bitpos: [12]; default: 0;
         *  Represents ch44 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled44:1;
        /** etm_ch_enabled45 : R/WTC/WTS; bitpos: [13]; default: 0;
         *  Represents ch45 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled45:1;
        /** etm_ch_enabled46 : R/WTC/WTS; bitpos: [14]; default: 0;
         *  Represents ch46 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled46:1;
        /** etm_ch_enabled47 : R/WTC/WTS; bitpos: [15]; default: 0;
         *  Represents ch47 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled47:1;
        /** etm_ch_enabled48 : R/WTC/WTS; bitpos: [16]; default: 0;
         *  Represents ch48 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled48:1;
        /** etm_ch_enabled49 : R/WTC/WTS; bitpos: [17]; default: 0;
         *  Represents ch49 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t etm_ch_enabled49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_reg_t;

/** Type of etm_evt_st0 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** etm_gpio_evt_ch0_rise_edge_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents GPIO_evt_ch0_rise_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch0_rise_edge_st:1;
        /** etm_gpio_evt_ch1_rise_edge_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents GPIO_evt_ch1_rise_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch1_rise_edge_st:1;
        /** etm_gpio_evt_ch2_rise_edge_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents GPIO_evt_ch2_rise_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch2_rise_edge_st:1;
        /** etm_gpio_evt_ch3_rise_edge_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents GPIO_evt_ch3_rise_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch3_rise_edge_st:1;
        /** etm_gpio_evt_ch4_rise_edge_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents GPIO_evt_ch4_rise_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch4_rise_edge_st:1;
        /** etm_gpio_evt_ch5_rise_edge_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents GPIO_evt_ch5_rise_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch5_rise_edge_st:1;
        /** etm_gpio_evt_ch6_rise_edge_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents GPIO_evt_ch6_rise_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch6_rise_edge_st:1;
        /** etm_gpio_evt_ch7_rise_edge_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents GPIO_evt_ch7_rise_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch7_rise_edge_st:1;
        /** etm_gpio_evt_ch0_fall_edge_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents GPIO_evt_ch0_fall_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch0_fall_edge_st:1;
        /** etm_gpio_evt_ch1_fall_edge_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GPIO_evt_ch1_fall_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch1_fall_edge_st:1;
        /** etm_gpio_evt_ch2_fall_edge_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents GPIO_evt_ch2_fall_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch2_fall_edge_st:1;
        /** etm_gpio_evt_ch3_fall_edge_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GPIO_evt_ch3_fall_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch3_fall_edge_st:1;
        /** etm_gpio_evt_ch4_fall_edge_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GPIO_evt_ch4_fall_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch4_fall_edge_st:1;
        /** etm_gpio_evt_ch5_fall_edge_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents GPIO_evt_ch5_fall_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch5_fall_edge_st:1;
        /** etm_gpio_evt_ch6_fall_edge_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GPIO_evt_ch6_fall_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch6_fall_edge_st:1;
        /** etm_gpio_evt_ch7_fall_edge_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GPIO_evt_ch7_fall_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch7_fall_edge_st:1;
        /** etm_gpio_evt_ch0_any_edge_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents GPIO_evt_ch0_any_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch0_any_edge_st:1;
        /** etm_gpio_evt_ch1_any_edge_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents GPIO_evt_ch1_any_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch1_any_edge_st:1;
        /** etm_gpio_evt_ch2_any_edge_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents GPIO_evt_ch2_any_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch2_any_edge_st:1;
        /** etm_gpio_evt_ch3_any_edge_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents GPIO_evt_ch3_any_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch3_any_edge_st:1;
        /** etm_gpio_evt_ch4_any_edge_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents GPIO_evt_ch4_any_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch4_any_edge_st:1;
        /** etm_gpio_evt_ch5_any_edge_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents GPIO_evt_ch5_any_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch5_any_edge_st:1;
        /** etm_gpio_evt_ch6_any_edge_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents GPIO_evt_ch6_any_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch6_any_edge_st:1;
        /** etm_gpio_evt_ch7_any_edge_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents GPIO_evt_ch7_any_edge trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_ch7_any_edge_st:1;
        /** etm_gpio_evt_zero_det_pos0_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents GPIO_evt_zero_det_pos0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_zero_det_pos0_st:1;
        /** etm_gpio_evt_zero_det_neg0_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents GPIO_evt_zero_det_neg0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_evt_zero_det_neg0_st:1;
        /** etm_ledc_evt_duty_chng_end_ch0_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_duty_chng_end_ch0_st:1;
        /** etm_ledc_evt_duty_chng_end_ch1_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_duty_chng_end_ch1_st:1;
        /** etm_ledc_evt_duty_chng_end_ch2_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_duty_chng_end_ch2_st:1;
        /** etm_ledc_evt_duty_chng_end_ch3_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_duty_chng_end_ch3_st:1;
        /** etm_ledc_evt_duty_chng_end_ch4_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_duty_chng_end_ch4_st:1;
        /** etm_ledc_evt_duty_chng_end_ch5_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_duty_chng_end_ch5_st:1;
    };
    uint32_t val;
} soc_etm_evt_st0_reg_t;

