espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_struct.h
/** Type of etm_evt_st1 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** etm_ledc_evt_duty_chng_end_ch6_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch6 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_duty_chng_end_ch6_st:1;
        /** etm_ledc_evt_duty_chng_end_ch7_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents LEDC_evt_duty_chng_end_ch7 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_duty_chng_end_ch7_st:1;
        /** etm_ledc_evt_ovf_cnt_pls_ch0_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_ovf_cnt_pls_ch0_st:1;
        /** etm_ledc_evt_ovf_cnt_pls_ch1_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_ovf_cnt_pls_ch1_st:1;
        /** etm_ledc_evt_ovf_cnt_pls_ch2_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_ovf_cnt_pls_ch2_st:1;
        /** etm_ledc_evt_ovf_cnt_pls_ch3_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_ovf_cnt_pls_ch3_st:1;
        /** etm_ledc_evt_ovf_cnt_pls_ch4_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_ovf_cnt_pls_ch4_st:1;
        /** etm_ledc_evt_ovf_cnt_pls_ch5_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_ovf_cnt_pls_ch5_st:1;
        /** etm_ledc_evt_ovf_cnt_pls_ch6_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch6 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_ovf_cnt_pls_ch6_st:1;
        /** etm_ledc_evt_ovf_cnt_pls_ch7_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch7 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_ovf_cnt_pls_ch7_st:1;
        /** etm_ledc_evt_time_ovf_timer0_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LEDC_evt_time_ovf_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_time_ovf_timer0_st:1;
        /** etm_ledc_evt_time_ovf_timer1_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LEDC_evt_time_ovf_timer1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_time_ovf_timer1_st:1;
        /** etm_ledc_evt_time_ovf_timer2_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LEDC_evt_time_ovf_timer2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_time_ovf_timer2_st:1;
        /** etm_ledc_evt_time_ovf_timer3_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LEDC_evt_time_ovf_timer3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_time_ovf_timer3_st:1;
        /** etm_ledc_evt_timer0_cmp_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents LEDC_evt_timer0_cmp trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_timer0_cmp_st:1;
        /** etm_ledc_evt_timer1_cmp_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents LEDC_evt_timer1_cmp trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_timer1_cmp_st:1;
        /** etm_ledc_evt_timer2_cmp_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents LEDC_evt_timer2_cmp trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_timer2_cmp_st:1;
        /** etm_ledc_evt_timer3_cmp_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents LEDC_evt_timer3_cmp trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_evt_timer3_cmp_st:1;
        /** etm_tg0_evt_cnt_cmp_timer0_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents TG0_evt_cnt_cmp_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_tg0_evt_cnt_cmp_timer0_st:1;
        /** etm_tg1_evt_cnt_cmp_timer0_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents TG1_evt_cnt_cmp_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_tg1_evt_cnt_cmp_timer0_st:1;
        /** etm_systimer_evt_cnt_cmp0_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents SYSTIMER_evt_cnt_cmp0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_systimer_evt_cnt_cmp0_st:1;
        /** etm_systimer_evt_cnt_cmp1_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents SYSTIMER_evt_cnt_cmp1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_systimer_evt_cnt_cmp1_st:1;
        /** etm_systimer_evt_cnt_cmp2_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents SYSTIMER_evt_cnt_cmp2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_systimer_evt_cnt_cmp2_st:1;
        /** etm_mcpwm0_evt_timer0_stop_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents MCPWM0_evt_timer0_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer0_stop_st:1;
        /** etm_mcpwm0_evt_timer1_stop_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents MCPWM0_evt_timer1_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer1_stop_st:1;
        /** etm_mcpwm0_evt_timer2_stop_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents MCPWM0_evt_timer2_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer2_stop_st:1;
        /** etm_mcpwm0_evt_timer0_tez_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents MCPWM0_evt_timer0_tez trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer0_tez_st:1;
        /** etm_mcpwm0_evt_timer1_tez_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents MCPWM0_evt_timer1_tez trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer1_tez_st:1;
        /** etm_mcpwm0_evt_timer2_tez_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents MCPWM0_evt_timer2_tez trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer2_tez_st:1;
        /** etm_mcpwm0_evt_timer0_tep_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents MCPWM0_evt_timer0_tep trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer0_tep_st:1;
        /** etm_mcpwm0_evt_timer1_tep_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents MCPWM0_evt_timer1_tep trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer1_tep_st:1;
        /** etm_mcpwm0_evt_timer2_tep_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents MCPWM0_evt_timer2_tep trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm0_evt_timer2_tep_st:1;
    };
    uint32_t val;
} soc_etm_evt_st1_reg_t;

