espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_struct.h
/** Type of etm_task_st0 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** etm_gpio_task_ch0_set_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents GPIO_task_ch0_set trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch0_set_st:1;
        /** etm_gpio_task_ch1_set_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents GPIO_task_ch1_set trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch1_set_st:1;
        /** etm_gpio_task_ch2_set_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents GPIO_task_ch2_set trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch2_set_st:1;
        /** etm_gpio_task_ch3_set_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents GPIO_task_ch3_set trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch3_set_st:1;
        /** etm_gpio_task_ch4_set_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents GPIO_task_ch4_set trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch4_set_st:1;
        /** etm_gpio_task_ch5_set_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents GPIO_task_ch5_set trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch5_set_st:1;
        /** etm_gpio_task_ch6_set_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents GPIO_task_ch6_set trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch6_set_st:1;
        /** etm_gpio_task_ch7_set_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents GPIO_task_ch7_set trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch7_set_st:1;
        /** etm_gpio_task_ch0_clear_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents GPIO_task_ch0_clear trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch0_clear_st:1;
        /** etm_gpio_task_ch1_clear_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GPIO_task_ch1_clear trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch1_clear_st:1;
        /** etm_gpio_task_ch2_clear_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents GPIO_task_ch2_clear trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch2_clear_st:1;
        /** etm_gpio_task_ch3_clear_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GPIO_task_ch3_clear trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch3_clear_st:1;
        /** etm_gpio_task_ch4_clear_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GPIO_task_ch4_clear trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch4_clear_st:1;
        /** etm_gpio_task_ch5_clear_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents GPIO_task_ch5_clear trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch5_clear_st:1;
        /** etm_gpio_task_ch6_clear_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GPIO_task_ch6_clear trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch6_clear_st:1;
        /** etm_gpio_task_ch7_clear_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GPIO_task_ch7_clear trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch7_clear_st:1;
        /** etm_gpio_task_ch0_toggle_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents GPIO_task_ch0_toggle trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch0_toggle_st:1;
        /** etm_gpio_task_ch1_toggle_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents GPIO_task_ch1_toggle trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch1_toggle_st:1;
        /** etm_gpio_task_ch2_toggle_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents GPIO_task_ch2_toggle trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch2_toggle_st:1;
        /** etm_gpio_task_ch3_toggle_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents GPIO_task_ch3_toggle trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch3_toggle_st:1;
        /** etm_gpio_task_ch4_toggle_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents GPIO_task_ch4_toggle trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch4_toggle_st:1;
        /** etm_gpio_task_ch5_toggle_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents GPIO_task_ch5_toggle trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch5_toggle_st:1;
        /** etm_gpio_task_ch6_toggle_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents GPIO_task_ch6_toggle trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch6_toggle_st:1;
        /** etm_gpio_task_ch7_toggle_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents GPIO_task_ch7_toggle trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gpio_task_ch7_toggle_st:1;
        /** etm_ledc_task_timer0_res_update_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents LEDC_task_timer0_res_update trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer0_res_update_st:1;
        /** etm_ledc_task_timer1_res_update_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents LEDC_task_timer1_res_update trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer1_res_update_st:1;
        /** etm_ledc_task_timer2_res_update_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents LEDC_task_timer2_res_update trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer2_res_update_st:1;
        /** etm_ledc_task_timer3_res_update_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents LEDC_task_timer3_res_update trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer3_res_update_st:1;
        /** etm_ledc_task_duty_scale_update_ch0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_duty_scale_update_ch0_st:1;
        /** etm_ledc_task_duty_scale_update_ch1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_duty_scale_update_ch1_st:1;
        /** etm_ledc_task_duty_scale_update_ch2_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_duty_scale_update_ch2_st:1;
        /** etm_ledc_task_duty_scale_update_ch3_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_duty_scale_update_ch3_st:1;
    };
    uint32_t val;
} soc_etm_task_st0_reg_t;

