espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_struct.h
/** Type of etm_task_st1 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** etm_ledc_task_duty_scale_update_ch4_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_duty_scale_update_ch4_st:1;
        /** etm_ledc_task_duty_scale_update_ch5_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_duty_scale_update_ch5_st:1;
        /** etm_ledc_task_duty_scale_update_ch6_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch6 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_duty_scale_update_ch6_st:1;
        /** etm_ledc_task_duty_scale_update_ch7_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch7 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_duty_scale_update_ch7_st:1;
        /** etm_ledc_task_timer0_cap_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LEDC_task_timer0_cap trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer0_cap_st:1;
        /** etm_ledc_task_timer1_cap_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LEDC_task_timer1_cap trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer1_cap_st:1;
        /** etm_ledc_task_timer2_cap_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LEDC_task_timer2_cap trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer2_cap_st:1;
        /** etm_ledc_task_timer3_cap_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LEDC_task_timer3_cap trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer3_cap_st:1;
        /** etm_ledc_task_sig_out_dis_ch0_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_sig_out_dis_ch0_st:1;
        /** etm_ledc_task_sig_out_dis_ch1_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_sig_out_dis_ch1_st:1;
        /** etm_ledc_task_sig_out_dis_ch2_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_sig_out_dis_ch2_st:1;
        /** etm_ledc_task_sig_out_dis_ch3_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_sig_out_dis_ch3_st:1;
        /** etm_ledc_task_sig_out_dis_ch4_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_sig_out_dis_ch4_st:1;
        /** etm_ledc_task_sig_out_dis_ch5_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_sig_out_dis_ch5_st:1;
        /** etm_ledc_task_sig_out_dis_ch6_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch6 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_sig_out_dis_ch6_st:1;
        /** etm_ledc_task_sig_out_dis_ch7_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch7 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_sig_out_dis_ch7_st:1;
        /** etm_ledc_task_ovf_cnt_rst_ch0_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_ovf_cnt_rst_ch0_st:1;
        /** etm_ledc_task_ovf_cnt_rst_ch1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_ovf_cnt_rst_ch1_st:1;
        /** etm_ledc_task_ovf_cnt_rst_ch2_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_ovf_cnt_rst_ch2_st:1;
        /** etm_ledc_task_ovf_cnt_rst_ch3_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_ovf_cnt_rst_ch3_st:1;
        /** etm_ledc_task_ovf_cnt_rst_ch4_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_ovf_cnt_rst_ch4_st:1;
        /** etm_ledc_task_ovf_cnt_rst_ch5_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_ovf_cnt_rst_ch5_st:1;
        /** etm_ledc_task_ovf_cnt_rst_ch6_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch6 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_ovf_cnt_rst_ch6_st:1;
        /** etm_ledc_task_ovf_cnt_rst_ch7_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch7 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_ovf_cnt_rst_ch7_st:1;
        /** etm_ledc_task_timer0_rst_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents LEDC_task_timer0_rst trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer0_rst_st:1;
        /** etm_ledc_task_timer1_rst_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents LEDC_task_timer1_rst trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer1_rst_st:1;
        /** etm_ledc_task_timer2_rst_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents LEDC_task_timer2_rst trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer2_rst_st:1;
        /** etm_ledc_task_timer3_rst_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents LEDC_task_timer3_rst trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer3_rst_st:1;
        /** etm_ledc_task_timer0_resume_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_task_timer0_resume trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer0_resume_st:1;
        /** etm_ledc_task_timer1_resume_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_task_timer1_resume trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer1_resume_st:1;
        /** etm_ledc_task_timer2_resume_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_task_timer2_resume trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer2_resume_st:1;
        /** etm_ledc_task_timer3_resume_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_task_timer3_resume trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer3_resume_st:1;
    };
    uint32_t val;
} soc_etm_task_st1_reg_t;

/** Type of etm_task_st2 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** etm_ledc_task_timer0_pause_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents LEDC_task_timer0_pause trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer0_pause_st:1;
        /** etm_ledc_task_timer1_pause_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents LEDC_task_timer1_pause trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer1_pause_st:1;
        /** etm_ledc_task_timer2_pause_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents LEDC_task_timer2_pause trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer2_pause_st:1;
        /** etm_ledc_task_timer3_pause_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents LEDC_task_timer3_pause trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_timer3_pause_st:1;
        /** etm_ledc_task_fade_restart_ch0_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LEDC_task_fade_restart_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_restart_ch0_st:1;
        /** etm_ledc_task_fade_restart_ch1_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LEDC_task_fade_restart_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_restart_ch1_st:1;
        /** etm_ledc_task_fade_restart_ch2_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LEDC_task_fade_restart_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_restart_ch2_st:1;
        /** etm_ledc_task_fade_restart_ch3_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LEDC_task_fade_restart_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_restart_ch3_st:1;
        /** etm_ledc_task_fade_restart_ch4_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LEDC_task_fade_restart_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_restart_ch4_st:1;
        /** etm_ledc_task_fade_restart_ch5_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LEDC_task_fade_restart_ch5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_restart_ch5_st:1;
        /** etm_ledc_task_fade_restart_ch6_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LEDC_task_fade_restart_ch6 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_restart_ch6_st:1;
        /** etm_ledc_task_fade_restart_ch7_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LEDC_task_fade_restart_ch7 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_restart_ch7_st:1;
        /** etm_ledc_task_fade_pause_ch0_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LEDC_task_fade_pause_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_pause_ch0_st:1;
        /** etm_ledc_task_fade_pause_ch1_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LEDC_task_fade_pause_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_pause_ch1_st:1;
        /** etm_ledc_task_fade_pause_ch2_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents LEDC_task_fade_pause_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_pause_ch2_st:1;
        /** etm_ledc_task_fade_pause_ch3_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents LEDC_task_fade_pause_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_pause_ch3_st:1;
        /** etm_ledc_task_fade_pause_ch4_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents LEDC_task_fade_pause_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_pause_ch4_st:1;
        /** etm_ledc_task_fade_pause_ch5_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents LEDC_task_fade_pause_ch5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_pause_ch5_st:1;
        /** etm_ledc_task_fade_pause_ch6_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents LEDC_task_fade_pause_ch6 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_pause_ch6_st:1;
        /** etm_ledc_task_fade_pause_ch7_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents LEDC_task_fade_pause_ch7 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_pause_ch7_st:1;
        /** etm_ledc_task_fade_resume_ch0_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents LEDC_task_fade_resume_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_resume_ch0_st:1;
        /** etm_ledc_task_fade_resume_ch1_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents LEDC_task_fade_resume_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_resume_ch1_st:1;
        /** etm_ledc_task_fade_resume_ch2_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents LEDC_task_fade_resume_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_resume_ch2_st:1;
        /** etm_ledc_task_fade_resume_ch3_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents LEDC_task_fade_resume_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_resume_ch3_st:1;
        /** etm_ledc_task_fade_resume_ch4_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents LEDC_task_fade_resume_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_resume_ch4_st:1;
        /** etm_ledc_task_fade_resume_ch5_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents LEDC_task_fade_resume_ch5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_resume_ch5_st:1;
        /** etm_ledc_task_fade_resume_ch6_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents LEDC_task_fade_resume_ch6 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_resume_ch6_st:1;
        /** etm_ledc_task_fade_resume_ch7_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents LEDC_task_fade_resume_ch7 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ledc_task_fade_resume_ch7_st:1;
        /** etm_tg0_task_cnt_start_timer0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents TG0_task_cnt_start_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_tg0_task_cnt_start_timer0_st:1;
        /** etm_tg0_task_alarm_start_timer0_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents TG0_task_alarm_start_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_tg0_task_alarm_start_timer0_st:1;
        /** etm_tg0_task_cnt_stop_timer0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents TG0_task_cnt_stop_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_tg0_task_cnt_stop_timer0_st:1;
        /** etm_tg0_task_cnt_reload_timer0_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents TG0_task_cnt_reload_timer0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_tg0_task_cnt_reload_timer0_st:1;
    };
    uint32_t val;
} soc_etm_task_st2_reg_t;

