espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_struct.h
/** Type of etm_task_st4 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** etm_mcpwm1_task_cmpr1_b_up_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents MCPWM1_task_cmpr1_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_cmpr1_b_up_st:1;
        /** etm_mcpwm1_task_cmpr2_b_up_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents MCPWM1_task_cmpr2_b_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_cmpr2_b_up_st:1;
        /** etm_mcpwm1_task_gen_stop_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents MCPWM1_task_gen_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_gen_stop_st:1;
        /** etm_mcpwm1_task_timer0_syn_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents MCPWM1_task_timer0_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_timer0_syn_st:1;
        /** etm_mcpwm1_task_timer1_syn_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents MCPWM1_task_timer1_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_timer1_syn_st:1;
        /** etm_mcpwm1_task_timer2_syn_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents MCPWM1_task_timer2_syn trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_timer2_syn_st:1;
        /** etm_mcpwm1_task_timer0_period_up_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents MCPWM1_task_timer0_period_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_timer0_period_up_st:1;
        /** etm_mcpwm1_task_timer1_period_up_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents MCPWM1_task_timer1_period_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_timer1_period_up_st:1;
        /** etm_mcpwm1_task_timer2_period_up_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents MCPWM1_task_timer2_period_up trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_timer2_period_up_st:1;
        /** etm_mcpwm1_task_tz0_ost_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents MCPWM1_task_tz0_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_tz0_ost_st:1;
        /** etm_mcpwm1_task_tz1_ost_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents MCPWM1_task_tz1_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_tz1_ost_st:1;
        /** etm_mcpwm1_task_tz2_ost_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents MCPWM1_task_tz2_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_tz2_ost_st:1;
        /** etm_mcpwm1_task_clr0_ost_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents MCPWM1_task_clr0_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_clr0_ost_st:1;
        /** etm_mcpwm1_task_clr1_ost_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents MCPWM1_task_clr1_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_clr1_ost_st:1;
        /** etm_mcpwm1_task_clr2_ost_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents MCPWM1_task_clr2_ost trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_clr2_ost_st:1;
        /** etm_mcpwm1_task_cap0_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents MCPWM1_task_cap0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_cap0_st:1;
        /** etm_mcpwm1_task_cap1_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents MCPWM1_task_cap1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_cap1_st:1;
        /** etm_mcpwm1_task_cap2_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents MCPWM1_task_cap2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_mcpwm1_task_cap2_st:1;
        /** etm_adc_task_sample0_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents ADC_task_sample0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_adc_task_sample0_st:1;
        /** etm_adc_task_sample1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents ADC_task_sample1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_adc_task_sample1_st:1;
        /** etm_adc_task_start0_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents ADC_task_start0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_adc_task_start0_st:1;
        /** etm_adc_task_stop0_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents ADC_task_stop0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_adc_task_stop0_st:1;
        /** etm_regdma_task_start0_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents REGDMA_task_start0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_regdma_task_start0_st:1;
        /** etm_regdma_task_start1_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents REGDMA_task_start1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_regdma_task_start1_st:1;
        /** etm_regdma_task_start2_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents REGDMA_task_start2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_regdma_task_start2_st:1;
        /** etm_regdma_task_start3_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents REGDMA_task_start3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_regdma_task_start3_st:1;
        /** etm_tmpsnsr_task_start_sample_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents TMPSNSR_task_start_sample trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_tmpsnsr_task_start_sample_st:1;
        /** etm_tmpsnsr_task_stop_sample_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents TMPSNSR_task_stop_sample trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_tmpsnsr_task_stop_sample_st:1;
        /** etm_i2s0_task_start_rx_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents I2S0_task_start_rx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_i2s0_task_start_rx_st:1;
        /** etm_i2s0_task_start_tx_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents I2S0_task_start_tx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_i2s0_task_start_tx_st:1;
        /** etm_i2s0_task_stop_rx_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents I2S0_task_stop_rx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_i2s0_task_stop_rx_st:1;
        /** etm_i2s0_task_stop_tx_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents I2S0_task_stop_tx trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_i2s0_task_stop_tx_st:1;
    };
    uint32_t val;
} soc_etm_task_st4_reg_t;

/** Type of etm_task_st5 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** etm_i2s0_task_sync_check_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents I2S0_task_sync_check trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_i2s0_task_sync_check_st:1;
        /** etm_ulp_task_wakeup_cpu_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents ULP_task_wakeup_cpu trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ulp_task_wakeup_cpu_st:1;
        /** etm_ulp_task_int_cpu_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents ULP_task_int_cpu trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_ulp_task_int_cpu_st:1;
        /** etm_rtc_task_start_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents RTC_task_start trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_rtc_task_start_st:1;
        /** etm_rtc_task_stop_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents RTC_task_stop trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_rtc_task_stop_st:1;
        /** etm_rtc_task_clr_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents RTC_task_clr trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_rtc_task_clr_st:1;
        /** etm_rtc_task_triggerflw_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents RTC_task_triggerflw trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_rtc_task_triggerflw_st:1;
        /** etm_gdma_task_in_start_ch0_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents GDMA_task_in_start_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_in_start_ch0_st:1;
        /** etm_gdma_task_in_start_ch1_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents GDMA_task_in_start_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_in_start_ch1_st:1;
        /** etm_gdma_task_in_start_ch2_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GDMA_task_in_start_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_in_start_ch2_st:1;
        /** etm_gdma_task_in_start_ch3_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents GDMA_task_in_start_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_in_start_ch3_st:1;
        /** etm_gdma_task_in_start_ch4_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GDMA_task_in_start_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_in_start_ch4_st:1;
        /** etm_gdma_task_out_start_ch0_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GDMA_task_out_start_ch0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_out_start_ch0_st:1;
        /** etm_gdma_task_out_start_ch1_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents GDMA_task_out_start_ch1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_out_start_ch1_st:1;
        /** etm_gdma_task_out_start_ch2_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GDMA_task_out_start_ch2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_out_start_ch2_st:1;
        /** etm_gdma_task_out_start_ch3_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GDMA_task_out_start_ch3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_out_start_ch3_st:1;
        /** etm_gdma_task_out_start_ch4_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents GDMA_task_out_start_ch4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_gdma_task_out_start_ch4_st:1;
        /** etm_pmu_task_sleep_req_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents PMU_task_sleep_req trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_pmu_task_sleep_req_st:1;
        /** etm_modem_task_g0_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents MODEM_task_g0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_modem_task_g0_st:1;
        /** etm_modem_task_g1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents MODEM_task_g1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_modem_task_g1_st:1;
        /** etm_modem_task_g2_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents MODEM_task_g2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_modem_task_g2_st:1;
        /** etm_modem_task_g3_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MODEM_task_g3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_modem_task_g3_st:1;
        /** etm_zero_det_task_start_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents ZERO_DET_task_start trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t etm_zero_det_task_start_st:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} soc_etm_task_st5_reg_t;


/** Group: Configuration Register */
/** Type of etm_ch_ena_ad0_set register
 *  Channel enable set register
 */
typedef union {
    struct {
        /** etm_ch_enable0 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to enable ch0.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable0:1;
        /** etm_ch_enable1 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to enable ch1.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable1:1;
        /** etm_ch_enable2 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to enable ch2.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable2:1;
        /** etm_ch_enable3 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to enable ch3.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable3:1;
        /** etm_ch_enable4 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to enable ch4.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable4:1;
        /** etm_ch_enable5 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to enable ch5.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable5:1;
        /** etm_ch_enable6 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to enable ch6.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable6:1;
        /** etm_ch_enable7 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to enable ch7.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable7:1;
        /** etm_ch_enable8 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to enable ch8.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable8:1;
        /** etm_ch_enable9 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to enable ch9.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable9:1;
        /** etm_ch_enable10 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to enable ch10.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable10:1;
        /** etm_ch_enable11 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to enable ch11.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable11:1;
        /** etm_ch_enable12 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to enable ch12.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable12:1;
        /** etm_ch_enable13 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to enable ch13.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable13:1;
        /** etm_ch_enable14 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to enable ch14.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable14:1;
        /** etm_ch_enable15 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to enable ch15.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable15:1;
        /** etm_ch_enable16 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to enable ch16.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable16:1;
        /** etm_ch_enable17 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to enable ch17.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable17:1;
        /** etm_ch_enable18 : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to enable ch18.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable18:1;
        /** etm_ch_enable19 : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to enable ch19.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable19:1;
        /** etm_ch_enable20 : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to enable ch20.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable20:1;
        /** etm_ch_enable21 : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to enable ch21.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable21:1;
        /** etm_ch_enable22 : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to enable ch22.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable22:1;
        /** etm_ch_enable23 : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to enable ch23.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable23:1;
        /** etm_ch_enable24 : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to enable ch24.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable24:1;
        /** etm_ch_enable25 : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to enable ch25.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable25:1;
        /** etm_ch_enable26 : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to enable ch26.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable26:1;
        /** etm_ch_enable27 : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to enable ch27.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable27:1;
        /** etm_ch_enable28 : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to enable ch28.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable28:1;
        /** etm_ch_enable29 : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to enable ch29.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable29:1;
        /** etm_ch_enable30 : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to enable ch30.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable30:1;
        /** etm_ch_enable31 : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to enable ch31.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_set_reg_t;

