espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_struct.h
/** Type of etm_ch_ena_ad0_clr register
 *  Channel enable clear register
 */
typedef union {
    struct {
        /** etm_ch_disable0 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear ch0 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable0:1;
        /** etm_ch_disable1 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear ch1 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable1:1;
        /** etm_ch_disable2 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear ch2 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable2:1;
        /** etm_ch_disable3 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear ch3 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable3:1;
        /** etm_ch_disable4 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear ch4 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable4:1;
        /** etm_ch_disable5 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear ch5 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable5:1;
        /** etm_ch_disable6 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear ch6 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable6:1;
        /** etm_ch_disable7 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear ch7 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable7:1;
        /** etm_ch_disable8 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear ch8 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable8:1;
        /** etm_ch_disable9 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear ch9 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable9:1;
        /** etm_ch_disable10 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear ch10 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable10:1;
        /** etm_ch_disable11 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear ch11 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable11:1;
        /** etm_ch_disable12 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear ch12 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable12:1;
        /** etm_ch_disable13 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear ch13 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable13:1;
        /** etm_ch_disable14 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear ch14 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable14:1;
        /** etm_ch_disable15 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear ch15 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable15:1;
        /** etm_ch_disable16 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear ch16 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable16:1;
        /** etm_ch_disable17 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear ch17 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable17:1;
        /** etm_ch_disable18 : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear ch18 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable18:1;
        /** etm_ch_disable19 : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear ch19 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable19:1;
        /** etm_ch_disable20 : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear ch20 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable20:1;
        /** etm_ch_disable21 : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear ch21 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable21:1;
        /** etm_ch_disable22 : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear ch22 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable22:1;
        /** etm_ch_disable23 : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear ch23 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable23:1;
        /** etm_ch_disable24 : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear ch24 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable24:1;
        /** etm_ch_disable25 : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear ch25 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable25:1;
        /** etm_ch_disable26 : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear ch26 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable26:1;
        /** etm_ch_disable27 : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear ch27 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable27:1;
        /** etm_ch_disable28 : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear ch28 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable28:1;
        /** etm_ch_disable29 : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear ch29 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable29:1;
        /** etm_ch_disable30 : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear ch30 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable30:1;
        /** etm_ch_disable31 : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear ch31 enable.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ch_disable31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_clr_reg_t;

/** Type of etm_ch_ena_ad1_set register
 *  Channel enable set register
 */
typedef union {
    struct {
        /** etm_ch_enable32 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to enable ch32.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable32:1;
        /** etm_ch_enable33 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to enable ch33.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable33:1;
        /** etm_ch_enable34 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to enable ch34.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable34:1;
        /** etm_ch_enable35 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to enable ch35.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable35:1;
        /** etm_ch_enable36 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to enable ch36.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable36:1;
        /** etm_ch_enable37 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to enable ch37.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable37:1;
        /** etm_ch_enable38 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to enable ch38.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable38:1;
        /** etm_ch_enable39 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to enable ch39.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable39:1;
        /** etm_ch_enable40 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to enable ch40.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable40:1;
        /** etm_ch_enable41 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to enable ch41.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable41:1;
        /** etm_ch_enable42 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to enable ch42.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable42:1;
        /** etm_ch_enable43 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to enable ch43.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable43:1;
        /** etm_ch_enable44 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to enable ch44.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable44:1;
        /** etm_ch_enable45 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to enable ch45.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable45:1;
        /** etm_ch_enable46 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to enable ch46.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable46:1;
        /** etm_ch_enable47 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to enable ch47.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable47:1;
        /** etm_ch_enable48 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to enable ch48.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable48:1;
        /** etm_ch_enable49 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to enable ch49.
         *  0: Invalid, No effect
         *  1: Enable
         */
        uint32_t etm_ch_enable49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_set_reg_t;

