espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_struct.h
/** Type of etm_task_st4_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** etm_mcpwm1_task_cmpr1_b_up_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_cmpr1_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_cmpr1_b_up_st_clr:1;
        /** etm_mcpwm1_task_cmpr2_b_up_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_cmpr2_b_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_cmpr2_b_up_st_clr:1;
        /** etm_mcpwm1_task_gen_stop_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_gen_stop trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_gen_stop_st_clr:1;
        /** etm_mcpwm1_task_timer0_syn_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer0_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_timer0_syn_st_clr:1;
        /** etm_mcpwm1_task_timer1_syn_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer1_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_timer1_syn_st_clr:1;
        /** etm_mcpwm1_task_timer2_syn_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer2_syn trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_timer2_syn_st_clr:1;
        /** etm_mcpwm1_task_timer0_period_up_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer0_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_timer0_period_up_st_clr:1;
        /** etm_mcpwm1_task_timer1_period_up_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer1_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_timer1_period_up_st_clr:1;
        /** etm_mcpwm1_task_timer2_period_up_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_timer2_period_up trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_timer2_period_up_st_clr:1;
        /** etm_mcpwm1_task_tz0_ost_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_tz0_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_tz0_ost_st_clr:1;
        /** etm_mcpwm1_task_tz1_ost_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_tz1_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_tz1_ost_st_clr:1;
        /** etm_mcpwm1_task_tz2_ost_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_tz2_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_tz2_ost_st_clr:1;
        /** etm_mcpwm1_task_clr0_ost_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_clr0_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_clr0_ost_st_clr:1;
        /** etm_mcpwm1_task_clr1_ost_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_clr1_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_clr1_ost_st_clr:1;
        /** etm_mcpwm1_task_clr2_ost_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_clr2_ost trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_clr2_ost_st_clr:1;
        /** etm_mcpwm1_task_cap0_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_cap0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_cap0_st_clr:1;
        /** etm_mcpwm1_task_cap1_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_cap1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_cap1_st_clr:1;
        /** etm_mcpwm1_task_cap2_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear MCPWM1_task_cap2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_mcpwm1_task_cap2_st_clr:1;
        /** etm_adc_task_sample0_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear ADC_task_sample0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_adc_task_sample0_st_clr:1;
        /** etm_adc_task_sample1_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear ADC_task_sample1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_adc_task_sample1_st_clr:1;
        /** etm_adc_task_start0_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear ADC_task_start0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_adc_task_start0_st_clr:1;
        /** etm_adc_task_stop0_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear ADC_task_stop0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_adc_task_stop0_st_clr:1;
        /** etm_regdma_task_start0_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_regdma_task_start0_st_clr:1;
        /** etm_regdma_task_start1_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_regdma_task_start1_st_clr:1;
        /** etm_regdma_task_start2_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_regdma_task_start2_st_clr:1;
        /** etm_regdma_task_start3_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_regdma_task_start3_st_clr:1;
        /** etm_tmpsnsr_task_start_sample_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear TMPSNSR_task_start_sample trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_tmpsnsr_task_start_sample_st_clr:1;
        /** etm_tmpsnsr_task_stop_sample_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear TMPSNSR_task_stop_sample trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_tmpsnsr_task_stop_sample_st_clr:1;
        /** etm_i2s0_task_start_rx_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear I2S0_task_start_rx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_i2s0_task_start_rx_st_clr:1;
        /** etm_i2s0_task_start_tx_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear I2S0_task_start_tx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_i2s0_task_start_tx_st_clr:1;
        /** etm_i2s0_task_stop_rx_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear I2S0_task_stop_rx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_i2s0_task_stop_rx_st_clr:1;
        /** etm_i2s0_task_stop_tx_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear I2S0_task_stop_tx trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_i2s0_task_stop_tx_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st4_clr_reg_t;

/** Type of etm_task_st5_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** etm_i2s0_task_sync_check_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear I2S0_task_sync_check trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_i2s0_task_sync_check_st_clr:1;
        /** etm_ulp_task_wakeup_cpu_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear ULP_task_wakeup_cpu trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ulp_task_wakeup_cpu_st_clr:1;
        /** etm_ulp_task_int_cpu_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear ULP_task_int_cpu trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_ulp_task_int_cpu_st_clr:1;
        /** etm_rtc_task_start_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear RTC_task_start trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_rtc_task_start_st_clr:1;
        /** etm_rtc_task_stop_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear RTC_task_stop trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_rtc_task_stop_st_clr:1;
        /** etm_rtc_task_clr_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear RTC_task_clr trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_rtc_task_clr_st_clr:1;
        /** etm_rtc_task_triggerflw_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear RTC_task_triggerflw trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_rtc_task_triggerflw_st_clr:1;
        /** etm_gdma_task_in_start_ch0_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear GDMA_task_in_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_in_start_ch0_st_clr:1;
        /** etm_gdma_task_in_start_ch1_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear GDMA_task_in_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_in_start_ch1_st_clr:1;
        /** etm_gdma_task_in_start_ch2_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear GDMA_task_in_start_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_in_start_ch2_st_clr:1;
        /** etm_gdma_task_in_start_ch3_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear GDMA_task_in_start_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_in_start_ch3_st_clr:1;
        /** etm_gdma_task_in_start_ch4_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear GDMA_task_in_start_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_in_start_ch4_st_clr:1;
        /** etm_gdma_task_out_start_ch0_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear GDMA_task_out_start_ch0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_out_start_ch0_st_clr:1;
        /** etm_gdma_task_out_start_ch1_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear GDMA_task_out_start_ch1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_out_start_ch1_st_clr:1;
        /** etm_gdma_task_out_start_ch2_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear GDMA_task_out_start_ch2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_out_start_ch2_st_clr:1;
        /** etm_gdma_task_out_start_ch3_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear GDMA_task_out_start_ch3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_out_start_ch3_st_clr:1;
        /** etm_gdma_task_out_start_ch4_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear GDMA_task_out_start_ch4 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_gdma_task_out_start_ch4_st_clr:1;
        /** etm_pmu_task_sleep_req_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear PMU_task_sleep_req trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_pmu_task_sleep_req_st_clr:1;
        /** etm_modem_task_g0_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear MODEM_task_g0 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_modem_task_g0_st_clr:1;
        /** etm_modem_task_g1_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear MODEM_task_g1 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_modem_task_g1_st_clr:1;
        /** etm_modem_task_g2_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear MODEM_task_g2 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_modem_task_g2_st_clr:1;
        /** etm_modem_task_g3_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear MODEM_task_g3 trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_modem_task_g3_st_clr:1;
        /** etm_zero_det_task_start_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear ZERO_DET_task_start trigger status.
         *  0: Invalid, No effect
         *  1: Clear
         */
        uint32_t etm_zero_det_task_start_st_clr:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} soc_etm_task_st5_clr_reg_t;

/** Type of etm_clk_en register
 *  ETM clock enable register
 */
typedef union {
    struct {
        /** etm_clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to open register clock gate.
         *  0: Open the clock gate only when application writes registers
         *  1: Force open the clock gate for register
         */
        uint32_t etm_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} soc_etm_clk_en_reg_t;


