espressif/esp-idf/components/soc/esp32h4/register/soc/soc_etm_struct.h
/** Group: Version Register */
/** Type of etm_date register
 *  ETM date register
 */
typedef union {
    struct {
        /** etm_date : R/W; bitpos: [27:0]; default: 37777745;
         *  Configures the version.
         */
        uint32_t etm_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} soc_etm_date_reg_t;


typedef struct soc_etm_dev_t {
    volatile soc_etm_ch_ena_ad0_reg_t etm_ch_ena_ad0;
    volatile soc_etm_ch_ena_ad0_set_reg_t etm_ch_ena_ad0_set;
    volatile soc_etm_ch_ena_ad0_clr_reg_t etm_ch_ena_ad0_clr;
    volatile soc_etm_ch_ena_ad1_reg_t etm_ch_ena_ad1;
    volatile soc_etm_ch_ena_ad1_set_reg_t etm_ch_ena_ad1_set;
    volatile soc_etm_ch_ena_ad1_clr_reg_t etm_ch_ena_ad1_clr;
    volatile struct {
        soc_etm_chn_evt_id_reg_t eid;
        soc_etm_chn_task_id_reg_t tid;
    } channel[50];
    volatile soc_etm_evt_st0_reg_t etm_evt_st0;
    volatile soc_etm_evt_st0_clr_reg_t etm_evt_st0_clr;
    volatile soc_etm_evt_st1_reg_t etm_evt_st1;
    volatile soc_etm_evt_st1_clr_reg_t etm_evt_st1_clr;
    volatile soc_etm_evt_st2_reg_t etm_evt_st2;
    volatile soc_etm_evt_st2_clr_reg_t etm_evt_st2_clr;
    volatile soc_etm_evt_st3_reg_t etm_evt_st3;
    volatile soc_etm_evt_st3_clr_reg_t etm_evt_st3_clr;
    volatile soc_etm_evt_st4_reg_t etm_evt_st4;
    volatile soc_etm_evt_st4_clr_reg_t etm_evt_st4_clr;
    volatile soc_etm_evt_st5_reg_t etm_evt_st5;
    volatile soc_etm_evt_st5_clr_reg_t etm_evt_st5_clr;
    volatile soc_etm_evt_st6_reg_t etm_evt_st6;
    volatile soc_etm_evt_st6_clr_reg_t etm_evt_st6_clr;
    volatile soc_etm_task_st0_reg_t etm_task_st0;
    volatile soc_etm_task_st0_clr_reg_t etm_task_st0_clr;
    volatile soc_etm_task_st1_reg_t etm_task_st1;
    volatile soc_etm_task_st1_clr_reg_t etm_task_st1_clr;
    volatile soc_etm_task_st2_reg_t etm_task_st2;
    volatile soc_etm_task_st2_clr_reg_t etm_task_st2_clr;
    volatile soc_etm_task_st3_reg_t etm_task_st3;
    volatile soc_etm_task_st3_clr_reg_t etm_task_st3_clr;
    volatile soc_etm_task_st4_reg_t etm_task_st4;
    volatile soc_etm_task_st4_clr_reg_t etm_task_st4_clr;
    volatile soc_etm_task_st5_reg_t etm_task_st5;
    volatile soc_etm_task_st5_clr_reg_t etm_task_st5_clr;
    volatile soc_etm_clk_en_reg_t etm_clk_en;
    volatile soc_etm_date_reg_t etm_date;
} soc_etm_dev_t;

extern soc_etm_dev_t SOC_ETM;

#ifndef __cplusplus
_Static_assert(sizeof(soc_etm_dev_t) == 0x218, "Invalid size of soc_etm_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
